Repository: flow03/CoM-Archolos-Ukrainian-Translation
Catalog: DialogeOmegaT/omegat/project_save.tmx
Source language: pl
Languages: uk

source: Opanowałem Czwarty Krąg Magii Runicznej. Od teraz mogę używać run tego Kręgu. Lekcja była wyczerpująca, nie ma szans, bym poradził sobie z piątym Kręgiem.
uk: Я опанував четверте коло рунічної магії. Відтепер я можу використовувати руни цього кола. Навчання було вкрай виснажливим, з п'ятим колом мені не впоратися.

source: Opanowałem Drugi Krąg Magii Runicznej. Od teraz mogę używać run tego Kręgu. Było trochę trudniej niż wcześniej, ale bez wątpienia następny Krąg jest w moim zasięgu.
uk: Я опанував друге коло рунічної магії. Відтепер я можу використовувати руни цього кола. Це було трохи складніше, але, без сумніву, наступне коло мені під силу.

source: Opanowałem Pierwszy Krąg Magii Runicznej. Od teraz mogę używać run tego Kręgu. Myślę, że opanowanie następnego nie powinno stanowić dla mnie większego problemu.
uk: Я опанував перше коло рунічної магії. Відтепер я можу використовувати руни цього кола. Думаю, що освоєння наступного не повинно стати для мене великою проблемою.

source: Opanowałem Trzeci Krąg Magii Runicznej. Od teraz mogę używać run tego Kręgu. Nauka była bardzo wymagająca, ale jeśli mocno się postaram, to może dam radę opanować jeszcze czwarty.
uk: Я опанував третє коло рунічної магії. Відтепер я можу використовувати руни цього кола. Було дуже непросто, але якщо я добре постараюся, то, ймовірно, зможу опанувати й четверте коло.

source: Opatrunek będzie gotowy dopiero za kilka godzin.
uk: Пов'язка буде готова лише за кілька годин.

source: Opatrzność z góry
uk: Провидіння згори

source: Opiekuje się owcami w Dzielnicy Rzemieślników, w pobliżu wschodniej bramy koszar. Jeśli się zgubisz, zapytaj o drogę któregoś z gońców.
uk: Вона доглядає овець у Ремісничому кварталі, біля східних воріт казарм. Якщо ти заблукаєш, запитай дорогу в одного з провідників.

source: Opiekun slumsów
uk: Здоровань з нетрів

source: Opiekuni slumsów wypełnili swoją obietnicę. Jeden kłamca mniej.
uk: Здоровані з нетрів виконали свою обіцянку. Одним брехуном менше.

source: Opiekunowie nie będą zadowoleni, jeżeli coś mi zrobisz.
uk: Ці люди будуть незадоволені, якщо ти мені щось зробиш.

source: Opierając się na wyssanych z palca gdybaniach, postulują oni istnienie jakichś tajemniczych praw rządzących światem. I na tej podstawie wnioskują, że czasami muszą przysłużyć się pośrednio Beliarowi, a czasami Innosowi.
uk: Вони припускають існування якихось таємничих законів, які керують світом на основі здогадок. І на цій підставі роблять висновок, що іноді вони повинні опосередковано служити Беліару, а іноді - Інносу.

source: Opinie o mieście są przesadzone! Jedyne dobre miejsce na wyspie to wioska!
uk: Розповіді про місто перебільшені! Єдине гарне місце на острові – це село!

source: Opinie w mieście na jego temat też są podzielone.
uk: Думки про нього в місті теж розділилися.

source: Opis Rity pasuje do Neka. Porozmawiam z nim i upewnię się, czy chodzi o niego. Powinien ciągle siedzieć w tej jaskini obok winnicy.
uk: Опис Рити збігається з описом Нека. Я поговорю з ним і переконаюся, що це він. Він все ще має сидіти в тій печері біля виноградника.

source: Opis drugiego porywacza również potwierdza moje dotychczasowe ustalenia. Był to szczupły, wysoki i małomówny mężczyzna. Ben twierdzi, że go nie znał, ani nigdy wcześniej z nim nie pracował. Podobno to on zaprowadził Bena do chaty w Silbach.
uk: Опис другого викрадача також підтверджує мої попередні висновки. Це був худорлявий, високий і мовчазний чоловік. Бен стверджує, що не знав його і ніколи не працював з ним раніше. Очевидно, саме він привів Бена до хатини в Сільбаху.

source: Opis idealnie pasuje do 'Dużego Bena'. Jest bardzo niebezpiecznym człowiekiem, a do tego mało rozmownym.
uk: Цей опис ідеально підходить Великому Бену. Він дуже небезпечний, і до того ж не дуже балакучий.

source: Opis się zgadza.
uk: Опис співпадає.

source: Opis wyspy Archolos z perspektywy przybysza.
uk: Опис острова Архолос очима туриста.

source: Opisała tutaj, dlaczego nie lubi Fridy.
uk: Тут вона пояснила, чому їй не подобається Фріда.

source: Opisuje aktualny stan placówki.
uk: Описує поточний стан справ.

source: Opisuje, w jaki sposób można znaleźć zatrudnienie.
uk: В ньому описано, як знайти роботу.

source: Opisuje, w jaki sposób można zostać obywatelem.
uk: В ньому описано, як стати громадянином.

source: Oporny uczeń
uk: Неохочий учень

source: Opowiadaj! Wiesz, mamy już nawet z Gerhardem plan, który z pomocą pracowników winnicy może się powieść!
uk: Розповідай! Знаєш, у нас з Герхардом навіть вже є план, який може мати успіх з підтримкою працівників виноградника!

source: Opowiadaj.
uk: Розповідай.

source: Opowiadajcie lepiej co tam u was na Londram? Jak czuje się staruszek? Pewnie nie chciał porzucić tej cholernej kuźni.
uk: Розкажи краще, що відбувається на Лондрамі? Як почувається старий? Він, мабуть, так і не облишив ту кляту кузню.

source: Opowiadając na twoje pytanie - wyobraź sobie, co jesteśmy w stanie osiągnąć, gdybyśmy mogli zrobić zapas wody niezależnie od tego, w jakiej sytuacji jesteśmy.
uk: Відповідаючи на твоє запитання – уяви, чого б ми змогли досягти, якби могли створювати воду незалежно від того, в якій ситуації ми опинились.

source: Opowiadaliście ustaloną wersję?
uk: Ви розповідали їм усім ту ж історію?

source: Opowiadasz o żonie w burdelu?
uk: Ти обговорюєш свою дружину в борделі?

source: Opowiedz co zaszło między nim a Rodrigo.
uk: Розкажи, що сталося між ним і Родріго.

source: Opowiedz lepiej, co ty tutaj robisz.
uk: Розкажи краще, що ти тут робиш.

source: Opowiedz mi coś o Heldze.
uk: Розкажи мені щось про Хельгу.

source: Opowiedz mi coś o historii tego miejsca.
uk: Розкажи мені щось про історію цього місця.

source: Opowiedz mi coś o historii wyspy.
uk: Розкажи мені щось про історію острова.

source: Opowiedz mi coś o klasztorze.
uk: Розкажи мені щось про монастир.

source: Opowiedz mi coś o orkach.
uk: Розкажи мені щось про орків.

source: Opowiedz mi lepiej, co wiesz o tej 'Przystani'.
uk: Краще розкажи мені про цю 'Гавань'.

source: Opowiedz mi o Albynie.
uk: Розкажи мені про Альбіна.

source: Opowiedz mi o Benie.
uk: Розкажи мені про Бена.

source: Opowiedz mi o Bermarze.
uk: Розкажи мені про Бермара.

source: Opowiedz mi o Cortezie.
uk: Розкажи мені про Кортеза.

source: Opowiedz mi o Holdwigu.
uk: Розкажи мені про Гольдвіга.

source: Opowiedz mi o Lorenzo.
uk: Розкажи мені про Лоренцо.

source: Opowiedz mi o Magii.
uk: Розкажи мені про магію.

source: Opowiedz mi o Mandesie.
uk: Розкажи мені про Мандеса.

source: Opowiedz mi o Morrisie.
uk: Розкажи мені про Морріса.

source: Opowiedz mi o Mrocznym Paladynie.
uk: Розкажи мені про Темного Паладина.

source: Opowiedz mi o Przeorze.
uk: Розкажи мені про Настоятеля.

source: Opowiedz mi o Ramseyu.
uk: Розкажи мені про Рамзі.

source: Opowiedz mi o Ricie.
uk: Розкажи мені про Риту.

source: Opowiedz mi o Roderichu.
uk: Розкажи мені про Родеріха.

source: Opowiedz mi o Ulryku.
uk: Розкажи мені про Ульріка.

source: Opowiedz mi o Volkerze.
uk: Розкажи мені про Волкера.

source: Opowiedz mi o Wyspiarskim.
uk: Розкажи мені про Острівне.

source: Opowiedz mi o Wysłanniku Królewskim.
uk: Розкажи мені про Королівського посла.

source: Opowiedz mi o gospodarstwie.
uk: Розкажи мені про виноградник.

source: Opowiedz mi o orkach.
uk: Розкажи мені про орків.

source: Opowiedz mi o sobie.
uk: Розкажи про себе.

source: Opowiedz mi o tamtym dniu.
uk: Розкажи мені про той день.

source: Opowiedz mi o tej Bestii.
uk: Розкажи мені про цього Звіра.

source: Opowiedz mi o tej wieży sygnałowej.
uk: Розкажи мені про сигнальну вежу.

source: Opowiedz mi o tym chłopaku.
uk: Розкажи мені про цього хлопця.

source: Opowiedz mi o tym młynie.
uk: Розкажи мені про цей млин.

source: Opowiedz mi o tym.
uk: Розкажи мені про це.

source: Opowiedz mi o...
uk: Розкажи мені про...

source: Opowiedz mi więcej o najemnikach.
uk: Розкажи мені більше про найманців.

source: Opowiedz mi więcej o tej szajce.
uk: Розкажи мені більше про цю банду.

source: Opowiedz mi wszystko ze szczegółami.
uk: Розкажи мені все докладно.

source: Opowiedz o awanturze z Rodrigo.
uk: Розкажи про бійку з Родріго.

source: Opowiedziałem Corumowi o Baluenie. Jasno dałem do zrozumienia, że można go skreślić z listy poszukiwanych. Medyk był zadowolony z wykonanego przeze mnie zadania.
uk: Я розповів Коруму про Бейлена і ясно дав зрозуміти, що його можна більше не шукати. Медик залишився задоволений тим, як я виконав своє завдання.

source: Opowiedziałem Corumowi o Baluenie. Niestety drań przeżył, ale być może Oktav będzie mógł coś na to poradzić. Medyk był zadowolony z wykonanego przeze mnie zadania.
uk: Я розповів Коруму про Бейлена. На жаль, покидьок вижив, але, можливо, Октаву вдасться щось зробити. Медик залишився задоволений тим, як я виконав своє завдання.

source: Opowiedziałem Corumowi o Baluenie. Niestety nie miałem zbyt wielu informacji na jego temat, ale medyk był zadowolony z wykonanego przeze mnie zadania.
uk: Я розповів Коруму про Бейлена. На жаль, у мене було мало інформації про нього, але медик залишився задоволений тим, як я виконав своє завдання.

source: Opowiedziałem Lorenzo o podejrzanych rybakach w latarni. Może kiedyś nam to pomoże w wygryzieniu przemytników z interesu.
uk: Я розповів Лоренцо про підозрілих рибалок на маяку. Можливо, колись це допоможе нам вивести контрабандистів на чисту воду.

source: Opowiedziałem Lucasowi wszystko, czego się dowiedziałem. Zgodnie z obietnicą oddałem mu koło, a ten wypłacił mi nagrodę.
uk: Я розповів Лукасу все, що дізнався. Як і домовилися, я повернув йому шестерню, а він заплатив мені винагороду.

source: Opowiedziałem o agresywnych rybakach Roderichowi, ale nie oddałem mu paczki z zielem. Nie pozostaje mi nic innego, jak wrócić z nią do Nevila.
uk: Я розповів Родеріху про агресивних рибалок, але не віддав йому пакунок з травою. Мені нічого не залишається, як повернутися з ним до Невіла.

source: Opowiedziałem o planach Svena Haroldowi. Rybak powiedział, że podwoi nagrodę, jeśli uszkodzę łódź Svena, a nie jego. Łódź Svena znajduje się zaraz obok tej od Harolda.
uk: Я розповів Гарольду про плани Свена. Рибалка сказав, що подвоїть винагороду, якщо я пошкоджу човен Свена, а не його. Човен Свена стоїть поруч із човном Гарольда.

source: Opowiedziałeś tym wszystkim ludziom o tym, że Lichwiarz porywa i morduje ludzi?
uk: А ти розповідав усім цим людям про те, що Лихвар викрадає і вбиває людей?

source: Opowiedziałeś, że Lichwiarz porywa i morduje ludzi?
uk: А ти розповідав, що Лихвар викрадає і вбиває людей?

source: Opowiedzieli nam dokładnie to samo, co ty, więc wartownicy wpuścili ich bez większych problemów.
uk: Вони розповіли нам ту саму історію, що й ти, тож охорона впустила їх без жодних проблем.

source: Opowiedzieli wartownikom całą historię.
uk: Вони розповіли охоронцям свою історію.

source: Opowiem ci ogólnie, nie będę zanudzał. Następnie roztarty słód gotuję i dodaję do niego chmiel. Musi to potrwać kilka godzin. Po wszystkim piwo stygnie, a ja dodaję do niego szczyptę magii.
uk: Розповім у загальних рисах, не буду тебе втомлювати. Далі я варю перемелений солод і додаю до нього хміль. Це займає кілька годин. Після цього всього пиво охолоджується, а я додаю в нього дрібку магії.

source: Opowiem panu wszystko, jeśli tylko zechce mnie pan wysłuchać!
uk: Я розповім тобі все, якщо тільки забажаєш мене вислухати!

source: Opowiesz mi coś o prawach na wyspie?
uk: Розкажете мені про закони на острові?

source: Opowiesz mi coś o straży?
uk: Розкажеш мені щось про Варту?

source: Opowiesz mi coś więcej o tych przemytnikach?
uk: Можеш розповісти більше про цих контрабандистів?

source: Opowiesz mi ją przy beczce piwa, gdy już wykopiemy te kosztowności.
uk: Розкажеш мені за кухлем пива, коли ми відкопаємо скарби.

source: Opowiesz mi o paladynach?
uk: Розкажеш мені про паладинів?

source: Opowiesz mi, co się wydarzyło?
uk: Розкажеш мені, що сталося?

source: Opowiesz, czym się tu zajmujesz?
uk: Розкажеш, чим ти тут займаєшся?

source: Opowieść plagi
uk: Історія чуми

source: Opracowanie sposobu na ich zdobycie pozostawiam tobie, ale pamiętaj, jeśli zostaniesz przyłapany na kradzieży, to będziemy mieli wielkie kłopoty.
uk: Залишаю за тобою право вирішувати, як це все дістати. Але пам'ятай, якщо тебе спіймають на крадіжці, у нас будуть великі неприємності.

source: Oprawiam właśnie kretoszczura. Jeśli cię to zadowoli, to fiolkę sprzedam ci za 20 sztuk złota.
uk: Я зараз потрошу кротощура. Якщо він тебе задовольнить, то я продам флакон за 20 золотих.

source: Oprawianie zwierząt (skóry ssaków i skradanie)
uk: Основи мисливства та підкрадання

source: Oprócz fatalnych wieści z frontu? Niewiele.
uk: Окрім жахливих новин з фронту? Нічого особливого.

source: Oprócz grup błotniaków i topielców wałęsających się od czasu do czasu po mieliźnie, Ustronie jest oazą spokoju.
uk: За винятком кількох мулистих черепах та луркерів, які час від часу заходять на мілководдя, Прихисток моряка – це оазис спокою.

source: Oprócz kilku młokosów, większość miała ładnych parę lat służby za sobą. Między innymi Berto i Till, ludzie, którzy wielokrotnie udowadniali swoją wartość.
uk: За винятком кількох молодих, більшість із них мали за плечима кілька років служби. Зокрема, Берто і Тілль – це ті люди, які неодноразово доводили свою цінність.

source: Oprócz magów, jesteśmy jedynym bastionem spokoju w tym mieście.
uk: Окрім магів, ми – єдиний осередок спокою в цьому місті.

source: Oprócz mojego domu oraz tego, który jest w trakcie budowy, nie ma tu nic...
uk: Крім мого будинку і того, що будується, тут нічого немає...

source: Oprócz największej uprawy winogron, mamy również pokaźny sad jabłoni i solidne pola uprawne.
uk: Окрім найбільш врожайних виноградників, у нас також є великий яблуневий сад і родючі орні поля.

source: Oprócz nas był tam oswojony ork.
uk: Крім нас, там був один приручений орк.

source: Oprócz nas był tam pewien paladyn.
uk: Крім нас, там був ще паладин.

source: Oprócz nas był tam stary weteran wojenny.
uk: Крім нас, там був старий ветеран війни.

source: Oprócz niego jest jeszcze kilku członków Gildii, którzy mogliby pokazać ci to i owo. Po prostu rozejrzyj się w wolnej chwili po terenie baraków.
uk: Крім нього, є ще кілька членів Гільдії, які можуть щось запропонувати. Просто погуляй по казармах у вільний час.

source: Oprócz niego, nie przeżył nikt.
uk: Окрім нього, ніхто не вижив.

source: Oprócz pochwał nie ma tu nic ciekawego.
uk: Окрім похвали, тут немає нічого цікавого.

source: Oprócz polnych bestii, co mogło uszkodzić uprawy?
uk: Окрім польових жуків, що могло пошкодити посіви?

source: Oprócz przydzielania zadań, zajmuje się on też rekrutacją nowych.
uk: Крім розподілу завдань, він також займається вербуванням новобранців.

source: Oprócz skomplikowanego zamka, zadbałem by same drzwi były nie do sforsowania.
uk: Окрім надійного замка, я подбав про те, щоб самі двері були незламними.

source: Oprócz standardowej pensji, oferujemy również własną chatę w obozie górniczym oraz premie za ilość wydobytego kruszcu.
uk: На додаток до стандартної оплати, ми також пропонуємо вам власне житло у гірничому таборі та доплати за перевиконання плану з видобутку руди.

source: Oprócz strażnika już nikogo nie spotkaliście?
uk: Крім вартового, ви більше нікого не зустрічали?

source: Oprócz tego złamałeś jeszcze inne zasady.
uk: Крім цього, ти порушив й інші правила.

source: Oprócz tego, całkiem nieźle. Oczywiście, jeśli nikt nam nie przeszkadza i nie zadaje głupich pytań.
uk: В усьому іншому, досить непогано. Звісно, якщо ніхто не заважає і не ставить дурних запитань.

source: Oprócz tego, eliksir Dagoberta stanowi dla mnie dobrą okazję, bym udowodnił tym wszystkim starym i zrzędliwym magom, jak dobrym jestem alchemikiem.
uk: Крім того, еліксир Дагоберта – це чудова нагода довести всім цим старим і сварливим магам, який я гарний алхімік.

source: Oprócz tego, jak to sam ujął, 'masz nie brudzić przyrządów zielskami do mikstur leczniczych'.
uk: Окрім цього, як він сам висловився, 'ти не повинен бруднити інструменти травами для цілющого зілля'.

source: Oprócz tego, sprawdź okolice stawu za moją winnicą. Często widuję tam topielce, i byłoby dobrze, gdyby żaden z nich nie zbliżył się do mojego terenu.
uk: Ще оглянь територію навколо озера за моїм виноградником. Я частенько бачу там луркерів. Було б непогано, якби вони не наближалися до моїх володінь.

source: Oprócz tego, trzeba pomóc przewoźnikowi towarów. Do tej pory nie było czego transportować do miasta, ale powódź czy nie, podatki trzeba płacić i będziemy musieli spieniężyć część plonów.
uk: Крім того, ти маєш допомогти перевізнику товарів. Поки що не було чого везти в місто, але незважаючи на повінь, податки треба платити, і нам доведеться продати частину врожаю.

source: Oprócz tego, że mógłbym cię znacznie lepiej przeszkolić, to także sami magowie spojrzeliby na ciebie bardziej przychylnym okiem.
uk: Окрім того, що я зможу тебе значно краще навчити, самі маги також дивитимуться на тебе більш прихильно.

source: Oprócz waszej hordy każdy tutaj jest swój.
uk: Окрім вашої ватаги, тут всі свої.

source: Oprócz łatwej do zrozumienia furii, w której mnie zaatakował, wydawał się dość ludzki. Potrafił wypowiadać się na tyle sensownie, by obarczyć mnie winą za swoją sytuację.
uk: Окрім тваринної люті, з якою він накинувся на мене, він здавався цілком людяним. Він говорив досить розсудливо, оскільки звинуватив мене в тому, що він опинився в такій ситуації.

source: Opus magnum Ernesto
uk: Магнум Опус Ернесто

source: Opuszczona jaskinia przy mieście.
uk: Занедбана печера біля міста.

source: Opuszczona jaskinia przy winnicy Rity.
uk: Занедбана печера біля виноградника Рити.

source: Opuścili klasztor i udali się na zachód przez gęsty zagajnik. Larius pokazał Ezranowi piękno natury. Pokazał mu kępy rzecznego mirtu i porastające zagajniki fiołki. Pokazał też, jak mały błotniak stawia pierwsze kroki, tylko po to, by stać się pokarmem dla wilczycy i jej młodych.
uk: Вони вийшли з монастиря і попрямували на захід через густий гай. Ларіус продемонстрував Езрану усю красу природи. Він показав йому кущі річкового мирта і лісові фіалки. Також показав, як дитинча кротощура робить свої перші кроки, щоб потім стати їжею для вовчиці та її вовченят.

source: Opuścić kotwicę!
uk: Скинути якір!

source: Opuściłem arenę w trakcie walki. Nie powinienem tam wracać i oczekiwać możliwości wzięcia w kolejnych walkach.
uk: Я покинув арену під час бою. Не варто повертатися туди і розраховувати на те, що я зможу взяти участь у подальших поєдинках.

source: Opuściłem swoje stanowisko podczas patrolowania murów. Lepiej, żebym nie pokazywał się teraz Arethe na oczy...
uk: Я покинув свій пост, патрулюючи стіни. Тепер мені краще не попадатися Арету на очі...

source: Opuściłem szeregi straży. Oktav będzie musiał sam szukać kolejnych rekrutów.
uk: Я покинув Міську Варту. Октаву доведеться самостійно шукати нових рекрутів.

source: Opłaciłem Veita, przyśle do ciebie swoich ludzi.
uk: Я розрахувався з Вейтом, він пришле до тебе своїх людей.

source: Opłaciłem miejsce na cmentarzu dla Flory.
uk: Я заплатив за місце на цвинтарі для Флори.

source: Opłaciłem wartownika Harry'ego. Pójdzie z Ezekielem na wybrzeże.
uk: Я заплатив охоронцю Гаррі. Він піде з Єзекіїлем на узбережжя.

source: Opłata za wejście do kopalni wyniesie cię równe 100 sztuk złota.
uk: Плата за вхід до копальні становитиме рівно 100 золотих.

source: Orbity wszystkich planet, czyli drogi, jakie pokonują okrążając Morgrad, zmieniają się nieznacznie z upływem lat. Pewnym jest zatem, iż cały wszechświat zmierza powoli do jakiegoś celu.
uk: Орбіти всіх планет, тобто шляхи, які вони проходять навколо Морграду, з роками дещо змінюються. Тому можна з упевненістю стверджувати, що весь Всесвіт повільно рухається до якоїсь мети.

source: Organizowane są tam pojedynki na pięści. Idealna rozrywka na zabicie nudy.
uk: Там влаштовують кулачні бої. Ідеальна розвага, щоб розвіяти нудьгу.

source: Ork
uk: Орк

source: Ork-elita
uk: Елітний орк

source: Ork-herszt
uk: Вождь орків

source: Ork-kusznik
uk: Орк-арбалетник

source: Ork-szaman
uk: Орк-шаман

source: Ork-wojownik
uk: Орк-воїн

source: Ork-zwiadowca
uk: Орк-розвідник

source: Orka?
uk: Орка?

source: Orka? Żywego?! Taka okazja może się już więcej nie powtórzyć! Ruszajmy!
uk: Орка? Живого?! Такої можливості може більше ніколи не бути! Ходімо!

source: Orkom nie można odmówić zacięcia i waleczności.
uk: Оркам не можна відмовити в жорстокості та відвазі.

source: Orkowa Zaraza
uk: Нашестя орків

source: Orkowa flota ciągle krąży wokół wyspy. Zielonoskórzy są świetni w rekonesansie, więc doskonale wiedzą, co tu się dzieje. Mogą dzięki temu dobrze skoordynować swój atak.
uk: Флот орків досі кружляє навколо острова. Зеленошкірі мають гарних розвідників, тому вони точно знають, що тут відбувається. Це дозволяє їм добре скоординувати свій напад.

source: Orkowa kusza
uk: Арбалет орків

source: Orkowi przywódcy nie żyją, a my odzyskaliśmy farmę Bermara.
uk: Ватажки орків мертві, а ми відбили ферму Бермара.

source: Orkowi przywódcy pokonani, Archolos przynajmniej przez jakiś czas powinno być bezpieczne. Zdaje się, że Grayson chce ze mną omówić jeszcze jakąś sprawę.
uk: Вожді орків знищені, тепер Архолос буде в безпеці, принаймні деякий час. Здається, Грейсон хоче обговорити зі мною ще одну справу.

source: Orkowie na naszych wodach oznaczają kłopoty. Czas zamknąć przemyt na jakiś czas.
uk: Орки в наших водах означають біду. Пора на деякий час припинити контрабанду.

source: Orkowie nieźle się zdziwią, kiedy zobaczą, do czego jest zdolna straż miejska Archolos.
uk: Орки будуть дуже здивовані, коли побачать, на що здатна Міська Варта Архолосу.

source: Orkowie obrali Archolos na swój cel, ale udało nam się ich odeprzeć. A przynajmniej ich pierwszą falę.
uk: Орки обрали Архолос своєю ціллю, але нам вдалося їх відбити. Принаймні, першу хвилю.

source: Orkowie przygotowują się do inwazji na Archolos. Nie ma co do tego już żadnych wątpliwości. Wbrew temu, czego się spodziewaliśmy, nie zaatakują od strony portu.
uk: Орки готуються до вторгнення на Архолос. У цьому вже не залишилося жодних сумнівів. Всупереч нашим очікуванням, вони не атакуватимуть зі сторони порту.

source: Orkowie raczej nie grożą mi w grobowcu... mam tylko nadzieję, że nie zniszczą wyspy podczas mojej nieobecności.
uk: Орки навряд чи загрожуватимуть мені в гробниці... залишається сподіватися, що вони не знищать острів за моєї відсутності.

source: Orkowie stanowią coraz większe zagrożenie dla wyspy. Kiedy tu trafią, nie chcę polegać tylko na straży, więc jeśli miałbym do was dołączyć, to chciałbym wiedzieć, jak dobrze mnie wyszkolicie.
uk: Орки становлять все більшу загрозу для острова. Коли вони прийдуть сюди, я не хочу покладатися на одних лише вартових. Тому, якщо я приєднаюся до вас, я хотів би знати, наскільки добре ви мене тренуватимете.

source: Orkowie szykują inwazję. Tym razem moi ludzie nie wystarczą. Potrzebuję elity twoich najemników i łowców. W domu Kaleba masz zorganizować główną bazę naszej operacji, a wejścia obstawić tak, by nikt niepowołany nie przekroczył jej progu.
uk: Орки готують вторгнення. Цього разу моїх людей буде недостатньо. Мені потрібні твої елітні найманці і мисливці. У будинку Калеба ти повинен організувати головну базу нашої операції, а також охороняти входи, щоб жоден сторонній не переступив її поріг.

source: Orkowie szykują się do inwazji na wyspę. Jeśli chcemy ich powstrzymać, musimy przekonać Rodericha i Lorenzo do współpracy. Oby tylko nie było na to za późno.
uk: Орки готуються до вторгнення на острів. Якщо ми хочемо їх зупинити, то повинні переконати Родеріха і Лоренцо співпрацювати. Залишається сподіватися, що для цього ще не запізно.
